// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
//452 -> 11
//82 -> 10
//9012 -> 12
Console.Write("Введите любое положительное целое число: ");
int gitit = int.Parse(Console.ReadLine());
